### Terraform Plan 결과 요약

**terraform/aws/crispin-lab/core/ap-northeast-2**: 🔄 변경 사항 있음

<details><summary>세부 플랜 보기</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.private_subnet.aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "crispin-lab-ap-ne-2a-private-subnet"
        }
      + tags_all                                       = {
          + "Name" = "crispin-lab-ap-ne-2a-private-subnet"
        }
      + vpc_id                                         = "vpc-0a25ae5a4041dcebc"
    }

  # module.vpc_flow_log.aws_flow_log.this will be updated in-place
  ~ resource "aws_flow_log" "this" {
        id                         = "fl-097a5a89ad80d0a4c"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ log_destination            = (sensitive value)
        tags                       = {}
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>

*Pushed by: @crispindeity, Action: `pull_request`*